[JediLight X2UniversalSoldierClassInfo]
ClassSpecializationTitle="光明绝地"
ClassSpecializationSummary="绝地武士使用原力进行知识和防御...从不用于攻击."

[JediGrey X2UniversalSoldierClassInfo]
ClassSpecializationTitle="灰绝地"
ClassSpecializationSummary="原力的平衡是宇宙繁荣所必需的。没有平衡，一切都会分崩离析...我们有责任保持这种平衡，这就是我们如何实现真理：所有部分都需要创建一个整体......"

[JediDark X2UniversalSoldierClassInfo]
ClassSpecializationTitle="黑暗绝地"
ClassSpecializationSummary="但要小心黑暗的一面。愤怒，恐惧，侵略...原力的黑暗面是他们，很容易他们流动......如果一旦你开始走上黑暗的道路，它将永远主宰你的命运。消耗你，它会..."

